Revit 2017 API
AssetPropertyBoolean Class
 Represents a property of Boolean value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyBoolean : AssetProperty
Visual Basic
Public Class AssetPropertyBoolean _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyBoolean : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyBoolean
See Also
AssetPropertyBoolean Members
Autodesk.Revit.Utility Namespace